app/controllers/posts_controller.rb

    def create
        @post = Post.new(post_params)
        @post.user_id = current_user.id # assign the post to the user who created it.
        respond_to do |f|
            if (@post.save)
---
INSERT INTO "posts" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "Hello World I am having bug"], ["user_id", 3], ["created_at", "2016-03-30 13:20:28.465828"], ["updated_at", "2016-03-30 13:20:28.465828"]]